---
kind: property
id: P:Autodesk.Revit.DB.DirectContext3D.VertexPosition.Position
source: html/74cdd110-13db-3ae0-1f66-5ab208f3ea7c.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexPosition.Position Property

The vertex's position.

## Syntax (C#)
```csharp
public XYZ Position { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null